#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "VM-CRAFTLABS-01-nsg"
      + resource_group_name = "SR-CRAFTLAB-01"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "SR-CRAFTLAB-01"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "172.16.0.0/16",
        ]
      + dns_servers         = [
          + "1.1.1.1",
          + "1.0.0.1",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "virtualNetwork1"
      + resource_group_name = "SR-CRAFTLAB-01"
      + subnet              = [
          + {
              + address_prefix = "172.16.2.0/24"
              + id             = (known after apply)
              + name           = "default"
              + security_group = (known after apply)
            },
        ]
      + tags                = {
          + "environment" = "Production"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Validation and Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `./terraform`, Workspace: `default`*
